[
    {
        "id": "1",
        "name": "Créer une page web dynamique en JavaScript",
        "description": "Développement de la partie Front-end d'un site d'architecte. Gestion des événements avec manipulation du DOM en JS. Création d'une page de connexion avec vérification de l'authentification. Création de modales.",
        "picture": "../assets/Créer_une_page_web_dynamique_en_JavaScript.jpg",
        "tag": [
            "HTML 5",
            "CSS 3",
            "JavaScript",
            "modale",
            "Requête API"
        ],
        "repo": "https://github.com/JL8255/Portfolio-architecte-sophie-bluel.git"
    },
    {
        "id": "2",
        "name": "Planifier le développement du site d'un client",
        "description": "Configuration d'un outil de gestion de projets et d'un outil de veille technologique. Rédaction des spécifications et des solutions techniques. Elaboration du planning de réalisation du projet. Découpage en tickets. Equipe de développement organisée en methode agile.",
        "picture": "../assets/Planifier_le_développement_du_site_d'un_client.jpg",
        "tag": [
            "Méthode Agile",
            "Scrum",
            "Planning Poker",
            "Notion",
            "Trello",
            "Wakelet",
            "kanban"
        ],
        "repo": "https://github.com/JL8255/P4-Plannification-du-d-veloppement-d-un-site.git"
    },
    {
        "id": "3",
        "name": "Débuggage et optimisation d'un site de photographe",
        "description": "Débuggage du code existant. Optimisation des performances de chargement du site. Amélioration du référencement du site (SEO) et de l'accessibilité. Rédaction du rapport d'intervention",
        "picture": "../assets/Débuggage_et_optimisation_d'un_site_de_photographe.jpg",
        "tag": [
            "HTML 5",
            "CSS 3",
            "Jquery",
            "Bootstrap",
            "Lighthouse",
            "WAVE Evaluation Tool",
            "SEO",
            "Réseaux sociaux",
            "<meta />",
            "Schema.org",
            "Google Rich Snippet"
        ],
        "repo": "https://github.com/JL8255/P5-Nina-Carducci.git"
    },
    {
        "id": "4",
        "name": "Création d'une application web de location immobilière",
        "description": "Utilisation de la librairie React JS. Mise en place de l'environnement de développement et de “build” avec Create React App. Utilisation de React router pour configurer les routes.",
        "picture": "../assets/Création_d'une_application_web_de_location_immobilière.jpg",
        "tag": [
            "Create React App",
            "React.js",
            "React router",
            "Node.js",
            "Sass - pattern 7.1",
            "Figma"
        ],
        "repo": "https://github.com/JL8255/P6-JLH-Kasa.git"
    },
    {
        "id": "5",
        "name": "Développer le back-end d'un site de notation de livres",
        "description": "Création d'une API RESTful permettant de se connecter de manière sécurisée à l'application. De pouvoir faire appel à une base de donnée NoSQL MongoDB en lecture écriture : opérations CRUD. Configuration de middlewares de traitement des réquêtes, téléchargement de fichiers avec 'multer' et d'authentification sécurisée des utilisateurs. Respect du Green code pour le stockage des images avec retraitement de la taille et du poids avec 'sharp'.",
        "picture": "../assets/Développer_le_back-end_d'un_site_de_notation.jpg",
        "tag": [
            "Node.js",
            "MongoDB",
            "API RESTful",
            "CRUD",
            "Multer",
            "Sharp",
            "JSON Web Tokens"
        ],
        "repo": "https://github.com/JL8255/P7-Dev-Web-livres.git"
    }
]